app/controllers/workstations_controller.rb

SELECT "workstations".* FROM "workstations" WHERE (OS = 'OS X 10.8.3 (12D78)')
SELECT "workstations".* FROM "workstations"
---
  def index

   # this will be a hash of params and their values
   # e.g. model => MacBookPro4,1
    @filters = params.except("action","controller")


    # there must be a nicer way to do this?
    if @filters.keys.include?("model")
      @workstations = Workstation.where("model = ?", @filters.fetch("model"))

    elsif @filters.keys.include?("OS")

SELECT "workstations".* FROM "workstations" WHERE "workstations"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @workstation = Workstation.find(params[:id])

SELECT "workstations".* FROM "workstations" WHERE "workstations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @workstation = Workstation.find(params[:id])

SELECT "workstations".* FROM "workstations" WHERE "workstations"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "workstations" SET "name" = 'cph41raabyjMBP', "model" = 'MacBookPro4,1', "updated_at" = '2013-05-06 10:04:14.835110', "information" = '--- {}
---
  def update
    @workstation = Workstation.find(params[:id])

    respond_to do |format|
      if @workstation.update_attributes(params[:workstation])

SELECT "workstations".* FROM "workstations" WHERE "workstations"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "workstations" WHERE "workstations"."id" = ?  [["id", 6]]
---
  def destroy
    @workstation = Workstation.find(params[:id])
    @workstation.destroy